markup.org
#+TITLE: XProc Test Suite markup
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/org.css"/>
#+OPTIONS: toc:t num:3 H:4 ^:nil pri:t html-postamble:nil html-style:nil

# This org-mode file documents the test-suite.rnc schema file.
# It needs to be tangled and woven.
# In Emacs, C-c C-v t will tangle it; C-c C-e will export the
# “woven” documentation (C-c C-e h h for HTML; C-c C-e l p for PDF).

* Introduction
:PROPERTIES:
:CUSTOM_ID: introduction
:END:

The XProc Test Suite consists of a set of test suite documents and
assorted ancillary files. The test suite documents are defined by the
schema described in this document.

The test suite schema is normatively defined in RELAX NG Compact
Syntax, but it isn’t necessary for an implementation to use this
schema for validation.

Each individual test is defined by a ~test~ element. Tests can be grouped
together with ~div~ elements and/or collected together in a ~test-suite~.
A test suite document must begin with one of these elements.
All of the test suite elements are in the test suite namespace, see 
[[*Namespaces][Namespaces]].

#+NAME: start
#+BEGIN_SRC rnc
start = test | test-suite | test-div
#+END_SRC

* Metadata
:PROPERTIES:
:CUSTOM_ID: metadata
:END:

All tests, test suites, and divisions begin with a required metadata
element named ~info~. Metadata consists of a ~title~, a simple string
with inline markup, a ~revision-history~ that documents changes to the
test, and optional ~specref~ elements.

#+NAME: info
#+BEGIN_SRC rnc
info =
    element t:info {
        title
        & revision-history
        & specref*
    }
#+END_SRC

** Revision history
:PROPERTIES:
:CUSTOM_ID: revision-history
:END:

A revision history is a collection of one or more revisions.

#+NAME: revision-history
#+BEGIN_SRC rnc
revision-history =
    element t:revision-history {
        revision+
    }
#+END_SRC

Revisions /must/ be listed in reverse chronological order, so the most
recent revision appears first. Each revision consists of a ~date~, an ~author~,
and a ~description~ of the revision (see [[*Description][Description]]).

#+NAME: revision
#+BEGIN_SRC rnc
revision =
    element t:revision {
        attribute initials { text }?,
        date,
        author?,
        description
    }
#+END_SRC

The ~date~ must be an ISO 8601 /date/ or /dateTime/. An ~author~
has a ~name~ and an optional ~email~ address and ~uri~. The ~description~
should describe what has been changed and why.

#+NAME: author
#+BEGIN_SRC rnc
author =
    element t:author {
        attribute initials { text }?
      & name?
      & email?
      & uri?
    }
#+END_SRC

*** Author initials
:PROPERTIES:
:CUSTOM_ID: author-initials
:END:

Repeating all of the author information in each revision can be
tedious. The ~initials~ attribute can simplify the markup: it acts as
an ID/IDREF link. The first time an author is mentioned, provide as
much information as possible and mark that author with a (unique) set
of initials. In other revisions, specify the author initials but leave
the author element otherwise empty. For example, both of these
revisions have the same authorship:

#+BEGIN_SRC xml
    <t:revision>
      <t:date>2020—01-04</t:date>
      <t:author initials="jd"/>
      <t:description xmlns="http://www.w3.org/1999/xhtml">
        <p>Corrected typo in test.</p>
      </t:description>
    </t:revision>

    <t:revision>
      <t:date>2019-12—31</t:date>
      <t:author initials="jd">
        <t:name>Jane Doe</t:name>
        <t:email>jane@example.com</t:email>
        <t:uri>https://example.com/jane/</t:uri>
      </t:author>
      <t:description xmlns="http://www.w3.org/1999/xhtml">
        <p>Initial checkin.</p>
      </t:description>
    </t:revision>
#+END_SRC

** Specref
:PROPERTIES:
:CUSTOM_ID: specref
:END:

If a test, or set of tests, relates to a particular aspect of a
particular specification, a link can be provided. The link consists of
a ~spec~ attribute that identifies the specification and a ~linkend~
attribute that must contain the ID value in the specification with
which this test is associated.

#+NAME: specref
#+BEGIN_SRC rnc
specref =
    element t:specref {
        attribute spec { "xproc" | "steps" }?
      & attribute linkend { xsd:NMTOKEN }
      & empty
    }
#+END_SRC

(It’s not clear if this turned out to be as useful in practice as it was in theory.)

* Description
:PROPERTIES:
:CUSTOM_ID: description
:END:

The description can contain any mixture of text and HTML elements. HTML elements
must be in the HTML namespace:
src_emacs-lisp[:noweb yes :exports results]{"<<html_namespace>>"}{{{results(=http://www.w3.org/1999/xhtml=)}}}.

