src/main/resources/markup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-01-05 Sun 18:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>XProc Test Suite markup</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Norman Walsh" />
<link rel="stylesheet" type="text/css" href="css/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">XProc Test Suite markup</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#introduction">1. Introduction</a></li>
<li><a href="#metadata">2. Metadata</a>
<ul>
<li><a href="#revision-history">2.1. Revision history</a>
<ul>
<li><a href="#author-initials">2.1.1. Author initials</a></li>
</ul>
</li>
<li><a href="#specref">2.2. Specref</a></li>
</ul>
</li>
<li><a href="#description">3. Description</a></li>
<li><a href="#test-suites">4. Test suites and divisions</a></li>
<li><a href="#common-attributes">5. Common attributes</a></li>
<li><a href="#tests">6. Tests</a>
<ul>
<li><a href="#properties">6.1. Properties</a></li>
<li><a href="#inputs">6.2. Inputs</a></li>
<li><a href="#options">6.3. Options</a></li>
<li><a href="#pipeline">6.4. Pipeline</a></li>
<li><a href="#schematron">6.5. Schematron</a></li>
</ul>
</li>
<li><a href="#namespaces">7. Namespaces</a></li>
<li><a href="#composed-schema">8. Relax NG Schema</a></li>
</ul>
</div>
</div>

<div id="outline-container-org3d0ffc4" class="outline-2">
<h2 id="introduction"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-introduction">
<p>
The XProc Test Suite consists of a set of test suite documents and
assorted ancillary files. The test suite documents are defined by the
schema described in this document.
</p>

<p>
The test suite schema is normatively defined in RELAX NG Compact
Syntax, but it isn’t necessary for an implementation to use this
schema for validation.
</p>

<p>
Each individual test is defined by a <code>test</code> element. Tests can be grouped
together with <code>div</code> elements and/or collected together in a <code>test-suite</code>.
A test suite document must begin with one of these elements.
All of the test suite elements are in the test suite namespace, see 
<a href="#namespaces">Namespaces</a>.
</p>

<div class="org-src-container">
<pre class="src src-rnc" id="org878311e"><span style="color: #388E3C;">start</span> = test | test-suite | test-div
</pre>
</div>
</div>
</div>

<div id="outline-container-org9929e8d" class="outline-2">
<h2 id="metadata"><span class="section-number-2">2</span> Metadata</h2>
<div class="outline-text-2" id="text-metadata">
<p>
All tests, test suites, and divisions begin with a required metadata
element named <code>info</code>. Metadata consists of a <code>title</code>, a simple string
with inline markup, a <code>revision-history</code> that documents changes to the
test, and optional <code>specref</code> elements.
</p>

<div class="org-src-container">
<pre class="src src-rnc" id="orgef296b3"><span style="color: #388E3C;">info</span> =
    <span style="color: #bf360c;">element</span> t:info <span style="color: #707183;">{</span>
        title
        &amp; revision-history
        &amp; specref*
    <span style="color: #707183;">}</span>
</pre>
</div>
</div>

<div id="outline-container-org808a12f" class="outline-3">
<h3 id="revision-history"><span class="section-number-3">2.1</span> Revision history</h3>
<div class="outline-text-3" id="text-revision-history">
<p>
A revision history is a collection of one or more revisions.
</p>

<div class="org-src-container">
<pre class="src src-rnc" id="org19eb5a2"><span style="color: #388E3C;">revision-history</span> =
    <span style="color: #bf360c;">element</span> t:revision-history <span style="color: #707183;">{</span>
        revision+
    <span style="color: #707183;">}</span>
</pre>
</div>

<p>
Revisions <i>must</i> be listed in reverse chronological order, so the most
recent revision appears first. Each revision consists of a <code>date</code>, an <code>author</code>,
and a <code>description</code> of the revision (see <a href="#description">Description</a>).
</p>

<div class="org-src-container">
<pre class="src src-rnc" id="org7537e52"><span style="color: #388E3C;">revision</span> =
    <span style="color: #bf360c;">element</span> t:revision <span style="color: #707183;">{</span>
        <span style="color: #bf360c;">attribute</span> <span style="color: #455A64;">initials</span> <span style="color: #7388d6;">{</span> <span style="color: #bf360c;">text</span> <span style="color: #7388d6;">}</span>?,
        date,
        author?,
        description
    <span style="color: #707183;">}</span>
</pre>
</div>

<p>
The <code>date</code> must be an ISO 8601 <i>date</i> or <i>dateTime</i>. An <code>author</code>
has a <code>name</code> and an optional <code>email</code> address and <code>uri</code>. The <code>description</code>
should describe what has been changed and why.
</p>

<div class="org-src-container">
<pre class="src src-rnc" id="org65902d6"><span style="color: #388E3C;">author</span> =
    <span style="color: #bf360c;">element</span> t:author <span style="color: #707183;">{</span>
        <span style="color: #bf360c;">attribute</span> <span style="color: #455A64;">initials</span> <span style="color: #7388d6;">{</span> <span style="color: #bf360c;">text</span> <span style="color: #7388d6;">}</span>?
      &amp; name?
      &amp; email?
      &amp; uri?
    <span style="color: #707183;">}</span>
</pre>
</div>
</div>

<div id="outline-container-org0a02358" class="outline-4">
<h4 id="author-initials"><span class="section-number-4">2.1.1</span> Author initials</h4>
<div class="outline-text-4" id="text-author-initials">
<p>
Repeating all of the author information in each revision can be
tedious. The <code>initials</code> attribute can simplify the markup: it acts as
an ID/IDREF link. The first time an author is mentioned, provide as
much information as possible and mark that author with a (unique) set
of initials. In other revisions, specify the author initials but leave
the author element otherwise empty. For example, both of these
revisions have the same authorship:
</p>

<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #795548;">t</span>:<span style="color: #388E3C;">revision</span>&gt;
  &lt;<span style="color: #795548;">t</span>:<span style="color: #388E3C;">date</span>&gt;2020&#8212;01-04&lt;/<span style="color: #795548;">t</span>:<span style="color: #388E3C;">date</span>&gt;
  &lt;<span style="color: #795548;">t</span>:<span style="color: #388E3C;">author</span> <span style="color: #455A64;">initials</span>=<span style="color: #6C3082;">"jd"</span>/&gt;
  &lt;<span style="color: #795548;">t</span>:<span style="color: #388E3C;">description</span> <span style="color: #795548;">xmlns</span>=<span style="color: #6C3082;">"http://www.w3.org/1999/xhtml"</span>&gt;
    &lt;<span style="color: #388E3C;">p</span>&gt;Corrected typo in test.&lt;/<span style="color: #388E3C;">p</span>&gt;
  &lt;/<span style="color: #795548;">t</span>:<span style="color: #388E3C;">description</span>&gt;
&lt;/<span style="color: #795548;">t</span>:<span style="color: #388E3C;">revision</span>&gt;

&lt;<span style="color: #795548;">t</span>:<span style="color: #388E3C;">revision</span>&gt;
  &lt;<span style="color: #795548;">t</span>:<span style="color: #388E3C;">date</span>&gt;2019-12&#8212;31&lt;/<span style="color: #795548;">t</span>:<span style="color: #388E3C;">date</span>&gt;
  &lt;<span style="color: #795548;">t</span>:<span style="color: #388E3C;">author</span> <span style="color: #455A64;">initials</span>=<span style="color: #6C3082;">"jd"</span>&gt;
    &lt;<span style="color: #795548;">t</span>:<span style="color: #388E3C;">name</span>&gt;Jane Doe&lt;/<span style="color: #795548;">t</span>:<span style="color: #388E3C;">name</span>&gt;
    &lt;<span style="color: #795548;">t</span>:<span style="color: #388E3C;">email</span>&gt;jane@example.com&lt;/<span style="color: #795548;">t</span>:<span style="color: #388E3C;">email</span>&gt;
    &lt;<span style="color: #795548;">t</span>:<span style="color: #388E3C;">uri</span>&gt;https://example.com/jane/&lt;/<span style="color: #795548;">t</span>:<span style="color: #388E3C;">uri</span>&gt;
  &lt;/<span style="color: #795548;">t</span>:<span style="color: #388E3C;">author</span>&gt;
  &lt;<span style="color: #795548;">t</span>:<span style="color: #388E3C;">description</span> <span style="color: #795548;">xmlns</span>=<span style="color: #6C3082;">"http://www.w3.org/1999/xhtml"</span>&gt;
    &lt;<span style="color: #388E3C;">p</span>&gt;Initial checkin.&lt;/<span style="color: #388E3C;">p</span>&gt;
  &lt;/<span style="color: #795548;">t</span>:<span style="color: #388E3C;">description</span>&gt;
&lt;/<span style="color: #795548;">t</span>:<span style="color: #388E3C;">revision</span>&gt;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3b7e6b2" class="outline-3">
<h3 id="specref"><span class="section-number-3">2.2</span> Specref</h3>
<div class="outline-text-3" id="text-specref">
<p>
If a test, or set of tests, relates to a particular aspect of a
particular specification, a link can be provided. The link consists of
a <code>spec</code> attribute that identifies the specification and a <code>linkend</code>
attribute that must contain the ID value in the specification with
which this test is associated.
</p>

<div class="org-src-container">
<pre class="src src-rnc" id="org889d672"><span style="color: #388E3C;">specref</span> =
    <span style="color: #bf360c;">element</span> t:specref <span style="color: #707183;">{</span>
        <span style="color: #bf360c;">attribute</span> <span style="color: #455A64;">spec</span> <span style="color: #7388d6;">{</span> <span style="color: #6C3082;">"xproc"</span> | <span style="color: #6C3082;">"steps"</span> <span style="color: #7388d6;">}</span>?
      &amp; <span style="color: #bf360c;">attribute</span> <span style="color: #455A64;">linkend</span> <span style="color: #7388d6;">{</span> xsd:NMTOKEN <span style="color: #7388d6;">}</span>
      &amp; <span style="color: #bf360c;">empty</span>
    <span style="color: #707183;">}</span>
</pre>
</div>

<p>
(It’s not clear if this turned out to be as useful in practice as it was in theory.)
</p>
</div>
</div>
</div>

<div id="outline-container-orga55afe7" class="outline-2">
<h2 id="description"><span class="section-number-2">3</span> Description</h2>
<div class="outline-text-2" id="text-description">
<p>
The description can contain any mixture of text and HTML elements. HTML elements
must be in the HTML namespace:
<code>http://www.w3.org/1999/xhtml</code>.
</p>
</div>
</div>
