markup.org
* Test suites and divisions
:PROPERTIES:
:CUSTOM_ID: test-suites
:END:

The ~test-suite~ and ~div~ elements serve to group tests together.

#+NAME: test-suite
#+BEGIN_SRC rnc
test-suite =
    element t:test-suite {
        testattr,
        (info, description?, property*, test*, test-div*)
    }
#+END_SRC

Divisions may be nested.

#+NAME: test-div
#+BEGIN_SRC rnc
test-div =
    element t:div {
        (info, description?, property*, test*, test-div*)
    }
#+END_SRC

* Common attributes
:PROPERTIES:
:CUSTOM_ID: common-attributes
:END:

Each ~test~ (and ~test-suite~) has attributes to identify the features
it requires and the circumstances under which it should be run.

#+NAME: testattr
#+BEGIN_SRC rnc
testattr = attribute features {
               list { xsd:token+ }
           } ?
           & attribute when { text }?
           & attribute src { text }?
           & attribute version { text }?
#+END_SRC

The attributes should be interpreted as follows:

+ ~features~ is a set of one or more feature tokens. Feature tokens identify
  features that the implementation must support in order for this test to pass.
  The test should be skipped if it identifies any unsupported features.

  The set of feature tokens is a bit ad hoc. Here’s a summary of the feature
  tokens at the time this document was written:

  + ~archive-order~, ???
  + ~dtd-id-ref-warning~, a RELAX NG validator capable of reporting
    DTD-based ID/IDREF warnings is required.
  + ~lazy-eval~, lazy evaluation of variable bindings is required.
  + ~p-validate-with-relax-ng~, a RELAX NG validator is required.
  + ~p-validate-with-schematron~, a Schematron validator is required.
  + ~p-validate-with-xsd~, a W3C XML Schema validator is required.
  + ~webaccess~, access to the web is required (this test cannot be run offline).
  + ~xquery_1_0~, an XQuery 1.0 processor is required.
  + ~xquery_3_0~, an XQuery 3.0 processor is required.
  + ~xquery_3_1~, an XQuery 3.1 processor is required.
  + ~xslt-1~, an XSLT 1.0 processor is required.
  + ~xslt-1-output-base-uri~, ???
  + ~xslt-2~, an XSLT 2.0 processor is required.
  + ~xslt-3~, an XSLT 3.0 processor is required.
  + ~xslt-serialization~, ???

+ ~when~ specifies an XPath expression that can be evaluated statically by
  the test processor. If the effective boolean value of the result is ~false()~, the
  test is ignored.

+ ~src~ specifies a URI where the ~test~ (or ~test-suite~) is located. If this
  attribute is specified, the element on which it occurs must be empty.
  
+ ~version~ specifies the version of the XProc processor required for this test.

* Tests
:PROPERTIES:
:CUSTOM_ID: tests
:END:

There are two kinds of tests, passing tests and failing tests.

#+NAME: test
#+BEGIN_SRC rnc
test = passingTest | failingTest
#+END_SRC

Passing and failing tests are mostly the same. Tests have [[*Common attributes][common
attributes]], [[*Metadata][metadata]], and a [[*Description][description]]. The body of the test in each
case consists of ~property~, ~input~, ~output~, and ~pipeline~
elements.

A passing test has an ~expected~ attribute (that must have the value be ~pass~)
and may have ~schematron~ tests to verify the results.

#+NAME: passingTest
#+BEGIN_SRC rnc
passingTest =
    element t:test {
        testattr
      & attribute expected { "pass" }
      & (info, description?,
         (property* & input* & option* & pipeline? & schematron?))
    }
#+END_SRC

A failing test has an ~expected~ attribute (that must have the value be ~fail~)
and must specify one or more expected error conditions.

#+NAME: failingTest
#+BEGIN_SRC rnc
failingTest =
    element t:test {
        testattr
      & attribute expected { "fail" }
      & attribute code { xsd:NMTOKENS }
      & (info, description?,
         (property* & input* & option* & pipeline?))
    }
#+END_SRC

Broadly speaking, the test harness sets the specified properties and
runs the specified pipeline with the specified inputs and options. A
passing test must complete without error, or it must be recorded as a
failure. If it completes, its output is tested against any Schematron
rules provided. No assertions must be raised.

If a failing test raises one of the specified error codes, it is a
“pass” from the perspective of the test suite, otherwise it must be
recorded as a failure.

Like tests and test-suites, inputs, pipelines, and Schematron rules
can be specified inline or with a ~src~ attribute that points to their
content.

** Properties
:PROPERTIES:
:CUSTOM_ID: properties
:END:

A property is a name/value pair. These must be made available to the
implementation, but the precise mechanism is necessarily
implementation defined.

#+NAME: property
#+BEGIN_SRC rnc
property =
    element t:property {
        attribute name { text }
      & attribute value { text }
    }
#+END_SRC

On the Java platform, these are system properties.

