src/main/resources/markup.html

<div id="outline-container-org12384dd" class="outline-2">
<h2 id="test-suites"><span class="section-number-2">4</span> Test suites and divisions</h2>
<div class="outline-text-2" id="text-test-suites">
<p>
The <code>test-suite</code> and <code>div</code> elements serve to group tests together.
</p>

<div class="org-src-container">
<pre class="src src-rnc" id="orga70c790"><span style="color: #388E3C;">test-suite</span> =
    <span style="color: #bf360c;">element</span> t:test-suite <span style="color: #707183;">{</span>
        testattr,
        <span style="color: #7388d6;">(</span>info, description?, property*, test*, test-div*<span style="color: #7388d6;">)</span>
    <span style="color: #707183;">}</span>
</pre>
</div>

<p>
Divisions may be nested.
</p>

<div class="org-src-container">
<pre class="src src-rnc" id="orgffa6c2f"><span style="color: #388E3C;">test-div</span> =
    <span style="color: #bf360c;">element</span> t:div <span style="color: #707183;">{</span>
        <span style="color: #7388d6;">(</span>info, description?, property*, test*, test-div*<span style="color: #7388d6;">)</span>
    <span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf656e9e" class="outline-2">
<h2 id="common-attributes"><span class="section-number-2">5</span> Common attributes</h2>
<div class="outline-text-2" id="text-common-attributes">
<p>
Each <code>test</code> (and <code>test-suite</code>) has attributes to identify the features
it requires and the circumstances under which it should be run.
</p>

<div class="org-src-container">
<pre class="src src-rnc" id="org27f2f9f"><span style="color: #388E3C;">testattr</span> = <span style="color: #bf360c;">attribute</span> <span style="color: #455A64;">features</span> <span style="color: #707183;">{</span>
               <span style="color: #bf360c;">list</span> <span style="color: #7388d6;">{</span> xsd:token+ <span style="color: #7388d6;">}</span>
           <span style="color: #707183;">}</span> ?
           &amp; <span style="color: #bf360c;">attribute</span> <span style="color: #455A64;">when</span> <span style="color: #707183;">{</span> <span style="color: #bf360c;">text</span> <span style="color: #707183;">}</span>?
           &amp; <span style="color: #bf360c;">attribute</span> <span style="color: #455A64;">src</span> <span style="color: #707183;">{</span> <span style="color: #bf360c;">text</span> <span style="color: #707183;">}</span>?
           &amp; <span style="color: #bf360c;">attribute</span> <span style="color: #455A64;">version</span> <span style="color: #707183;">{</span> <span style="color: #bf360c;">text</span> <span style="color: #707183;">}</span>?
</pre>
</div>

<p>
The attributes should be interpreted as follows:
</p>

<ul class="org-ul">
<li><p>
<code>features</code> is a set of one or more feature tokens. Feature tokens identify
features that the implementation must support in order for this test to pass.
The test should be skipped if it identifies any unsupported features.
</p>

<p>
The set of feature tokens is a bit ad hoc. Here’s a summary of the feature
tokens at the time this document was written:
</p>

<ul class="org-ul">
<li><code>archive-order</code>, ???</li>
<li><code>dtd-id-ref-warning</code>, a RELAX NG validator capable of reporting
DTD-based ID/IDREF warnings is required.</li>
<li><code>lazy-eval</code>, lazy evaluation of variable bindings is required.</li>
<li><code>p-validate-with-relax-ng</code>, a RELAX NG validator is required.</li>
<li><code>p-validate-with-schematron</code>, a Schematron validator is required.</li>
<li><code>p-validate-with-xsd</code>, a W3C XML Schema validator is required.</li>
<li><code>webaccess</code>, access to the web is required (this test cannot be run offline).</li>
<li><code>xquery_1_0</code>, an XQuery 1.0 processor is required.</li>
<li><code>xquery_3_0</code>, an XQuery 3.0 processor is required.</li>
<li><code>xquery_3_1</code>, an XQuery 3.1 processor is required.</li>
<li><code>xslt-1</code>, an XSLT 1.0 processor is required.</li>
<li><code>xslt-1-output-base-uri</code>, ???</li>
<li><code>xslt-2</code>, an XSLT 2.0 processor is required.</li>
<li><code>xslt-3</code>, an XSLT 3.0 processor is required.</li>
<li><code>xslt-serialization</code>, ???</li>
</ul></li>

<li><code>when</code> specifies an XPath expression that can be evaluated statically by
the test processor. If the effective boolean value of the result is <code>false()</code>, the
test is ignored.</li>

<li><code>src</code> specifies a URI where the <code>test</code> (or <code>test-suite</code>) is located. If this
attribute is specified, the element on which it occurs must be empty.</li>

<li><code>version</code> specifies the version of the XProc processor required for this test.</li>
</ul>
</div>
</div>

<div id="outline-container-org2a49be5" class="outline-2">
<h2 id="tests"><span class="section-number-2">6</span> Tests</h2>
<div class="outline-text-2" id="text-tests">
<p>
There are two kinds of tests, passing tests and failing tests.
</p>

<div class="org-src-container">
<pre class="src src-rnc" id="org9aaec8e"><span style="color: #388E3C;">test</span> = passingTest | failingTest
</pre>
</div>

<p>
Passing and failing tests are mostly the same. Tests have <a href="#common-attributes">common
attributes</a>, <a href="#metadata">metadata</a>, and a <a href="#description">description</a>. The body of the test in each
case consists of <code>property</code>, <code>input</code>, <code>output</code>, and <code>pipeline</code>
elements.
</p>

<p>
A passing test has an <code>expected</code> attribute (that must have the value be <code>pass</code>)
and may have <code>schematron</code> tests to verify the results.
</p>

<div class="org-src-container">
<pre class="src src-rnc" id="org9db4578"><span style="color: #388E3C;">passingTest</span> =
    <span style="color: #bf360c;">element</span> t:test <span style="color: #707183;">{</span>
        testattr
      &amp; <span style="color: #bf360c;">attribute</span> <span style="color: #455A64;">expected</span> <span style="color: #7388d6;">{</span> <span style="color: #6C3082;">"pass"</span> <span style="color: #7388d6;">}</span>
      &amp; <span style="color: #bf360c;">attribute</span> <span style="color: #455A64;">platform</span> <span style="color: #707183;">{</span> (<span style="color: #6C3082;">"Linux"</span> | <span style="color: #6C3082;">"MacOS"</span> | <span style="color: #6C3082;">"Windows"</span>) <span style="color: #707183;">}</span>?
      &amp; <span style="color: #7388d6;">(</span>info, description?,
         <span style="color: #909183;">(</span>property* &amp; input* &amp; option* &amp; pipeline? &amp; schematron?<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
    <span style="color: #707183;">}</span>
</pre>
</div>

<p>
A failing test has an <code>expected</code> attribute (that must have the value be <code>fail</code>)
and must specify one or more expected error conditions.
</p>

<div class="org-src-container">
<pre class="src src-rnc" id="orgc253219"><span style="color: #388E3C;">failingTest</span> =
    <span style="color: #bf360c;">element</span> t:test <span style="color: #707183;">{</span>
        testattr
      &amp; <span style="color: #bf360c;">attribute</span> <span style="color: #455A64;">expected</span> <span style="color: #7388d6;">{</span> <span style="color: #6C3082;">"fail"</span> <span style="color: #7388d6;">}</span>
      &amp; <span style="color: #bf360c;">attribute</span> <span style="color: #455A64;">code</span> <span style="color: #7388d6;">{</span> xsd:NMTOKENS <span style="color: #7388d6;">}</span>
      &amp; <span style="color: #bf360c;">attribute</span> <span style="color: #455A64;">platform</span> <span style="color: #707183;">{</span> (<span style="color: #6C3082;">"Linux"</span> | <span style="color: #6C3082;">"MacOS"</span> | <span style="color: #6C3082;">"Windows"</span>) <span style="color: #707183;">}</span>?
      &amp; <span style="color: #7388d6;">(</span>info, description?,
         <span style="color: #909183;">(</span>property* &amp; input* &amp; option* &amp; pipeline?<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
    <span style="color: #707183;">}</span>
</pre>
</div>

<p> Broadly speaking, the test harness sets the specified properties and runs the specified pipeline
                        with the specified inputs and options. A passing test must complete without
                        error, or it must be recorded as a failure. If it completes, its output is
                        tested against any Schematron rules provided. No assertions must be raised. </p>

<p> The platform attribute on a test marks this test to be run on the named platform only and to be
                        skipped otherwise. The attribute's value is expected to be one of  “Linux”,
                        “MacOS”, or “Windows”. </p>
    
<p>
If a failing test raises one of the specified error codes, it is a
“pass” from the perspective of the test suite, otherwise it must be
recorded as a failure.
</p>

<p>
Like tests and test-suites, inputs, pipelines, and Schematron rules
can be specified inline or with a <code>src</code> attribute that points to their
content.
</p>
</div>

<div id="outline-container-org75bb100" class="outline-3">
<h3 id="properties"><span class="section-number-3">6.1</span> Properties</h3>
<div class="outline-text-3" id="text-properties">
<p>
A property is a name/value pair. These must be made available to the
implementation, but the precise mechanism is necessarily
implementation defined.
</p>

<div class="org-src-container">
<pre class="src src-rnc" id="org6d22a11"><span style="color: #388E3C;">property</span> =
    <span style="color: #bf360c;">element</span> t:property <span style="color: #707183;">{</span>
        <span style="color: #bf360c;">attribute</span> <span style="color: #455A64;">name</span> <span style="color: #7388d6;">{</span> <span style="color: #bf360c;">text</span> <span style="color: #7388d6;">}</span>
      &amp; <span style="color: #bf360c;">attribute</span> <span style="color: #455A64;">value</span> <span style="color: #7388d6;">{</span> <span style="color: #bf360c;">text</span> <span style="color: #7388d6;">}</span>
    <span style="color: #707183;">}</span>
</pre>
</div>

<p>
On the Java platform, these are system properties.
</p>
</div>
</div>
